#### Outcome: 🟨  add=1 change=0 destroy=0
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```\n
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
KUBECONFIG not found and KUBECONFIG_TEXT not defined
[32m[1mSuccess![0m The configuration is valid.[0m
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff
TALOSCONFIG not found and TALOSCONFIG_TEXT not defined
KUBECONFIG not found and KUBECONFIG_TEXT not defined

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ + create

OpenTofu will perform the following actions:

# # github_actions_environment_secret.encrypted_secrets["development-k8s#TF_VAR_root_domain"] will be created
+ + resource "github_actions_environment_secret" "encrypted_secrets" {
+     + created_at      = (known after apply)
+     + environment     = "development-k8s"
+     + id              = (known after apply)
+     + plaintext_value = (sensitive value)
+     + repository      = "k6haze"
+     + secret_name     = "TF_VAR_root_domain"
+     + updated_at      = (known after apply)
+   }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @ryan-kraay-sigstore, Action: `pull_request`, Working Directory: ``, Workflow: `Full CI/CD Pipeline`*`;
<!-- Sticky Pull Request Commentcurator-github -->